parser/src/test/resources/net/www_eee/util/serialization/parser/xml/soap/departures_local_fault.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope">
  <env:Header>
    <w:departureYear xmlns:w="http://www_eee.net/ns/">2001</w:departureYear>
  </env:Header>
  <env:Body>
    <w:departures xmlns:w="http://www_eee.net/ns/">
      <w:departure>
        <w:departing>Canada</w:departing>
        <w:departureMonthDay>--01-01</w:departureMonthDay>
      </w:departure>
      <w:departure>
        <w:departing>USA</w:departing>
        <w:departureMonthDay>--02-01</w:departureMonthDay>
      </w:departure>
      <env:Fault>
        <env:Code>
          <env:Value>env:Receiver</env:Value>
        </env:Code>
        <env:Reason>
          <env:Text xml:lang="en-US">Invalid departure record.</env:Text>
        </env:Reason>
        <env:Detail>
          <jaxws:exception xmlns:jaxws="http://jax-ws.dev.java.net/" class="java.sql.SQLException">
            <jaxws:message>Foreign key violation.</jaxws:message>
            <jaxws:stackTrace>
              <jaxws:frame class="org.apache.tomcat.util.net.JIoEndpoint$SocketProcessor" file="JIoEndpoint.java" line="310" method="run" />
              <jaxws:frame class="java.util.concurrent.ThreadPoolExecutor" file="ThreadPoolExecutor.java" line="1145" method="runWorker" />
              <jaxws:frame class="java.util.concurrent.ThreadPoolExecutor$Worker" file="ThreadPoolExecutor.java" line="615" method="run" />
              <jaxws:frame class="java.lang.Thread" file="Thread.java" line="745" method="run" />
            </jaxws:stackTrace>
          </jaxws:exception>
        </env:Detail>
      </env:Fault>
      <w:departure>
        <w:departing>Australia</w:departing>
        <w:departureMonthDay>--03-01</w:departureMonthDay>
      </w:departure>
    </w:departures>
  </env:Body>
</env:Envelope>
